src/Catalogs/EmailAccounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>EmailAccounts</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmaiAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPServer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3Server</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPPort</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3Port</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPAuthentication</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SMTPAuthenticationSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPAuthenticationMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SMTPAuthenticationMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3AuthenticationMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.POP3AuthenticationMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Timeout</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LeaveMessageCopiesAtServer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemoveFromServerAfter</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForSending</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForReceiving</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeUserNameInPresentation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResponsibleForMessagesProcessing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/SMTPAuthenticationSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>SMTPAuthenticationSettings</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SimilarlyPOP3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SpecifiedAsParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POP3BeforeSMTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotDefined</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/EmailAccounts/Forms/ItemForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SECTION OF FORM AND FORM ITEMS EVENT HANDLERS
//

// Handler of event "OnCreateAtServer" of form
//
&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	If ValueIsFilled(Object.Password) Then
		KeepPassword = True;
	EndIf;
	
	// Hide not used items
	// if only the subsystem of work with emails is used
	If Metadata.CommonModules.Find("EMailsManagement") = Undefined Then
		Items.IncludeUserNameInPresentation.Visible = False;
	EndIf;
	
	If Object.Ref.IsEmpty() Then
		Object.UseForSending = True;
		Object.UseForReceiving = True;
	EndIf;
	
EndProcedure

// Handler of form event "before write at server"
//
&AtServer
Procedure BeforeWriteAtServer(Cancellation, CurrentObject)
	
	If NOT KeepPassword Then
		CurrentObject.Password = "";
	EndIf;
	
	If Object.SMTPAuthentication <> Enums.SMTPAuthenticationSettings.SpecifiedAsParameters Then
		Object.SMTPUser = "";
		Object.SMTPPassword = "";
	EndIf;
	
EndProcedure

// Handler of click event of button "Extra" of form
//
&AtClient
Procedure AdditionalSettingsRun()
	
	AccountStructure = New Structure;
	AccountStructure.Insert("Timeout",                    	Object.Timeout);
	AccountStructure.Insert("LeaveMessageCopiesAtServer", 	Object.LeaveMessageCopiesAtServer);
	AccountStructure.Insert("RemoveFromServerAfter", 		Object.RemoveFromServerAfter);
	AccountStructure.Insert("SMTPUser",                 	Object.SMTPUser);
	AccountStructure.Insert("SMTPPassword",                 Object.SMTPPassword);
	AccountStructure.Insert("POP3Port",                     Object.POP3Port);
	AccountStructure.Insert("SMTPPort",                     Object.SMTPPort);
	AccountStructure.Insert("SMTPAuthentication",           Object.SMTPAuthentication);
	AccountStructure.Insert("SMTPAuthenticationMode",       Object.SMTPAuthenticationMode);
	AccountStructure.Insert("POP3AuthenticationMode",       Object.POP3AuthenticationMode);
	
	CallParameters = New Structure("Ref, AccountStructure", Object.Ref, AccountStructure);
	
	OpenForm("Catalog.EMailAccounts.Form.AdditionalAccountParameters", CallParameters);
	
	
EndProcedure

// Handles the alert, coming from the form of settings of e-mail account additional properties,
// containing some e-mail account settings.
//
&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "SetAdditionalOptionsOfEMailAccount" And Source = Object.Ref Then
		Object.Timeout                    	= Parameter.ServerWaitDuration;
		Object.LeaveMessageCopiesAtServer 	= Parameter.LeaveMessageCopiesAtServer;
		Object.RemoveFromServerAfter 		= Parameter.RemoveFromServerAfter;
		Object.SMTPUser                 	= Parameter.SMTPUser;
		Object.SMTPPassword                 = Parameter.SMTPPassword;
		Object.POP3Port                     = Parameter.POP3Port;
		Object.SMTPPort                     = Parameter.SMTPPort;
		Object.SMTPAuthentication          = Parameter.SMTPAuthentication;
		Object.SMTPAuthenticationMode       = Parameter.SMTPAuthenticationMode;
		Object.POP3AuthenticationMode       = Parameter.POP3AuthenticationMode;
		Modified = True;
	EndIf;
	
EndProcedure
